Catalogs/НастройкиМобильногоПриложения.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиМобильногоПриложения</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ПодразделениеКомпании</Name>
					<Comment>Подразделение компании в котором был выписан документ</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.ПодразделенияКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СохраненнаяТаблицаКаталогов</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладЗаказа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкладВозвратов</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СкладыКомпании</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

InformationRegisters/МобильноеПриложениеСтруктураКаталога.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>МобильноеПриложениеСтруктураКаталога</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РодительГруппа</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РодительКатегория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЭтоГруппа</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>НастройкаМобильногоПриложения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиМобильногоПриложения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИдентификаторКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Номенклатура</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГруппаКаталога</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>РодительИдентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>40</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/НастройкиМобильногоПриложения/Ext/ObjectModule.bsl
Процедура ПриЗаписи(Отказ)
	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	вт_контрагенты.Контрагент КАК Контрагент
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗконтрагенты КАК вт_контрагенты
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.Контрагент КАК Контрагент,
	|	СУММА(ВложенныйЗапрос.сч) КАК сч
	|ПОМЕСТИТЬ вт_НовыеКонтрагенты
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ.Контрагент КАК Контрагент,
	|		1 КАК сч
	|	ИЗ
	|		ВТ КАК ВТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НастройкиМобильногоПриложенияКонтрагенты.Контрагент,
	|		-1
	|	ИЗ
	|		Справочник.НастройкиМобильногоПриложения.Контрагенты КАК НастройкиМобильногоПриложенияКонтрагенты
	|	ГДЕ
	|		НастройкиМобильногоПриложенияКонтрагенты.Ссылка = &Ссылка) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.Контрагент
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.сч) <> 0
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	вт_НовыеКонтрагенты.Контрагент КАК Ссылка
	|ИЗ
	|	вт_НовыеКонтрагенты КАК вт_НовыеКонтрагенты
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ТочкиДоставки.Ссылка
	|ИЗ
	|	вт_НовыеКонтрагенты КАК вт_НовыеКонтрагенты
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ТочкиДоставки КАК ТочкиДоставки
	|		ПО вт_НовыеКонтрагенты.Контрагент = ТочкиДоставки.Владелец";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТЗконтрагенты", Контрагенты.Выгрузить(,"Контрагент"));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ  РезультатЗапроса.Пустой() Тогда
		
		МассивПланыОбмена = ПланыОбмена.ОбменМобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбмена(Ссылка); 
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПланыОбмена.ЗарегистрироватьИзменения(МассивПланыОбмена,ВыборкаДетальныеЗаписи.Ссылка);
		КонецЦикла;
		
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 		"ВЫБРАТЬ
	|	вт_ВидыЦен.ВидЦены КАК ВидЦены
	|ПОМЕСТИТЬ ВТ
	|ИЗ
	|	&ТЗВидыЦен КАК вт_ВидыЦен
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВложенныйЗапрос.ВидЦены КАК ВидЦены,
	|	СУММА(ВложенныйЗапрос.Новый) КАК Новый
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТ.ВидЦены КАК ВидЦены,
	|		1 КАК Новый
	|	ИЗ
	|		ВТ КАК ВТ
	|	
	|	ОБЪЕДИНИТЬ ВСЕ
	|	
	|	ВЫБРАТЬ
	|		НастройкиМобильногоПриложенияВидыЦен.ВидЦены,
	|		-1
	|	ИЗ
	|		Справочник.НастройкиМобильногоПриложения.ВидыЦен КАК НастройкиМобильногоПриложенияВидыЦен) КАК ВложенныйЗапрос
	|
	|СГРУППИРОВАТЬ ПО
	|	ВложенныйЗапрос.ВидЦены
	|
	|ИМЕЮЩИЕ
	|	СУММА(ВложенныйЗапрос.Новый) <> 0";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ТЗВидыЦен", ВидыЦен.Выгрузить(,"ВидЦены"));
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ  РезультатЗапроса.Пустой() Тогда
		
		ЗапросТовары = Новый Запрос;
		ЗапросТовары.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
		ЗапросТовары.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
		|	МобильноеПриложениеСтруктураКаталога.Номенклатура КАК Номенклатура
		|ПОМЕСТИТЬ ВТ_Номенклатура
		|ИЗ
		|	РегистрСведений.МобильноеПриложениеСтруктураКаталога КАК МобильноеПриложениеСтруктураКаталога
		|ГДЕ
		|	МобильноеПриложениеСтруктураКаталога.НастройкаМобильногоПриложения = &НастройкаМобильногоПриложения";
		
		ЗапросТовары.УстановитьПараметр("НастройкаМобильногоПриложения", Ссылка);
		
		ЗапросТовары.Выполнить();
		
		МенеджерВременныхТаблиц = ЗапросТовары.МенеджерВременныхТаблиц;
		
		МассивПланыОбмена = ПланыОбмена.ОбменМобильноеПриложение.ПолучитьИспользуемыеУзлыПланаОбмена(Ссылка); 
		МассивЦен = Новый Массив;
		
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			МассивЦен.Добавить(ВыборкаДетальныеЗаписи.ВидЦены);
		КонецЦикла;
		Для Каждого мПланОбмена Из МассивПланыОбмена Цикл 	
			ОбменМобильноеПриложение.ЗарегистрироватьИзменениеДанныхЦены(мПланОбмена,МассивЦен,МенеджерВременныхТаблиц);
		КонецЦикла;
		
	КонецЕсли;
	
	
КонецПроцедуры
